import type { NavData } from "./types";
// {
//   icon: "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/31/bc/28/31bc28c0-ec9c-8ae3-be57-7450b35d1063/AppIcon-0-1x_U007emarketing-0-7-0-0-sRGB-85-220-0.png/230x0w.webp",
// icon: {
//   svg: '<svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>GitHub</title><path d="M12 .297c-6.63 0-12 5.373-12 12 0 5.303 3.438 9.8 8.205 11.385.6.113.82-.258.82-.577 0-.285-.01-1.04-.015-2.04-3.338.724-4.042-1.61-4.042-1.61C4.422 18.07 3.633 17.7 3.633 17.7c-1.087-.744.084-.729.084-.729 1.205.084 1.838 1.236 1.838 1.236 1.07 1.835 2.809 1.305 3.495.998.108-.776.417-1.305.76-1.605-2.665-.3-5.466-1.332-5.466-5.93 0-1.31.465-2.38 1.235-3.22-.135-.303-.54-1.523.105-3.176 0 0 1.005-.322 3.3 1.23.96-.267 1.98-.399 3-.405 1.02.006 2.04.138 3 .405 2.28-1.552 3.285-1.23 3.285-1.23.645 1.653.24 2.873.12 3.176.765.84 1.23 1.91 1.23 3.22 0 4.61-2.805 5.625-5.475 5.92.42.36.81 1.096.81 2.22 0 1.606-.015 2.896-.015 3.286 0 .315.21.69.825.57C20.565 22.092 24 17.592 24 12.297c0-6.627-5.373-12-12-12"/></svg>',
// },
//   title: "CSDN",
//   badge: {
//     text: "国内最常见",
//     type: "info",
//     type: "tip",
//     type: "warning",
//     type: "danger",
//   },
//   desc: "前端 API 兼容性查询",
//   link: "https://caniuse.com",
// },
export const NAV_DATA: NavData[] = [
  {
    title: "实用工具",
    items: [
      {
        icon: "https://tools.ytdevops.com/logo.png",
        title: "IT - Tools",
        desc: "助力开发人员和IT工作者",
        link: "https://tools.ytdevops.com/",
      },
      {
        icon: "https://jsoneditoronline.org/images/logo.png",
        title: "JSON Editor Online",
        badge: {
          text: "JSON编辑",
          type: "tip",
        },
        desc: "JSON Editor Online",
        link: "https://jsoneditoronline.org/#",
      },
      {
        icon: "https://cloudconvert.com/images/logo_flat_110_borderless.png",
        title: "在线云转换",
        badge: {
          text: "转换神器",
          type: "tip",
        },
        desc: "CloudConvert 是一款在线文件转换器。",
        link: "https://cloudconvert.com/",
      },
      {
        icon: "https://tool.lu/favicon.ico",
        title: "在线工具",
        desc: "开发人员的工具箱",
        link: "https://tool.lu",
      },
      {
        icon: "/TBeeCjRH.png",
        title: "Json 在线解析",
        desc: "JSON 在线解析及格式化验证",
        link: "https://www.json.cn",
      },
      {
        icon: "/JYSHARE-COM.png",
        title: "菜鸟工具",
        desc: "不止于工具",
        link: "https://www.jyshare.com/",
      },
      {
        icon: "https://tools.pdf24.org/static/img/pageIcons/svg/default.svg?v=5cae54fd",
        title: "PDF24 Tools",
        desc: "免费且易于使用的在线PDF工具",
        link: "https://tools.pdf24.org/zh/",
      },
    ],
  },
  {
    title: "社区",
    items: [
      {
        icon: "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/1c/67/ac/1c67accb-02dc-aedc-cd63-6896a5abdf43/AppIcon-0-0-1x_U007emarketing-0-8-0-85-220.png/230x0w.webp",
        title: "Github",
        desc: "全球最大开源社区",
        badge: {
          text: "Top1",
          type: "danger",
        },
        link: "https://github.com",
      },
      {
        icon: "/GITEE-copy.png",
        title: "Gitee",
        desc: "国内开源社区",
        link: "https://gitee.com",
      },
      {
        icon: "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/31/bc/28/31bc28c0-ec9c-8ae3-be57-7450b35d1063/AppIcon-0-1x_U007emarketing-0-7-0-0-sRGB-85-220-0.png/230x0w.webp",
        title: "CSDN",
        badge: {
          text: "国内最常见",
          type: "info",
        },
        desc: "CSDN——专业技术平台，成就一亿技术人。",
        link: "https://csdn.net",
      },
      {
        icon: "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/d4/a1/65/d4a1655f-51e4-4a50-884e-72c99a393959/AppIcon-1x_U007emarketing-0-7-0-85-220-0.png/230x0w.webp",
        title: "博客园",
        badge: {
          text: "老牌社区",
          type: "info",
        },
        desc: "代码改变世界 Coding Changes the World.",
        link: "https://www.cnblogs.com/",
      },
      {
        icon: "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/7f/65/e3/7f65e329-9603-d575-11b7-528cfa0b8bb8/AppIcon-0-0-1x_U007emarketing-0-7-0-85-220.png/230x0w.webp",
        title: "稀土掘金",
        // badge: {
        //   text: "国内最常见",
        //   type: "info",
        // },
        desc: "一个帮助开发者成长的社区",
        link: "https://juejin.cn/",
      },
      {
        icon: {
          svg: '<svg t="1737703417739" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10577" width="200" height="200"><path d="M656.90624 724.29056l47.42144-33.72544h52.68992V344.89856h-143.31904v346.7264h35.82976z" fill="#0066FF" p-id="10578"></path><path d="M849.92 51.2H174.08c-67.8656 0-122.88 55.0144-122.88 122.88v675.84c0 67.8656 55.0144 122.88 122.88 122.88h675.84c67.8656 0 122.88-55.0144 122.88-122.88V174.08c0-67.8656-55.0144-122.88-122.88-122.88zM495.66208 803.34848l-101.1712-157.05088 44.26752-31.616 67.45088 98.00704c-0.00512 0 23.17824 37.99552-10.5472 90.65984z m38.99392-276.10112v25.2928H408.19712C357.61152 876.06784 204.8 807.04512 204.8 807.04512c140.16512-109.86496 142.7968-254.50496 142.7968-254.50496H208.49152c0-57.9584 52.16256-56.91392 52.16256-56.91392h93.79328v-151.7568h-50.5856C284.89728 429.2352 204.8 425.02144 204.8 425.02144s32.67072-50.5856 54.79936-137.00096c22.12864-86.42048 89.5744-76.928 89.5744-76.928-20.0192 35.82976-29.50656 76.928-29.50656 76.928H485.12c40.04864 0 37.9392 25.2928 37.9392 25.2928v29.51168H411.35616v152.8064H503.04c33.72544 0 31.616 31.616 31.616 31.616zM819.2 747.49952h-102.22592l-88.51968 55.84896-8.42752-55.84896h-64.29184V288.01536H819.2v459.48416z" fill="#0066FF" p-id="10579"></path></svg>',
        },
        title: "知乎",
        badge: {
          text: "知乎",
          type: "info",
        },
        desc: "有问题，就会有答案。",
        link: "https://www.zhihu.com",
      },
    ],
  },
  {
    title: "其他站点导航",
    items: [
      {
        icon: "https://img.meituan.net/csc/41034187dfd3edf625adf95d12764ab54850.png",
        title: "下次一定.cn",
        desc: "白嫖党最爱",
        link: "https://www.iiice.cn/",
        badge: {
          text: "白嫖导航",
          type: "info",
        },
      },
      {
        icon: "https://nav.yiov.top/logo.png",
        title: "柳橙昔网址导航",
        desc: "不求最全，只求好用",
        link: "https://nav.yiov.top/",
      },
      {
        icon: "https://www.xiaozhongjishu.com/wp-content/uploads/2022/04/logo-2.png",
        title: "小众技术",
        desc: "小众技术工具库 | 专注分享实用软件和精品网站",
        link: "https://www.xiaozhongjishu.com/",
      },
    ],
  },
  {
    title: "娱乐&破解",
    items: [
      {
        icon: "https://www.apple.com.cn/app-store/images/overview/chiclets/hero_07_3__bfor3q9wivzm_large.jpg",
        title: "影视解析",
        desc: "VIP影视在线解析",
        link: "https://www.cdcer.net/jx/",
      },
      {
        icon: {
          svg: '<svg t="1737703350294" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5430" width="200" height="200"><path d="M958.87 684.48V347.75c0-0.91 0-1.81-0.13-2.69A31.89 31.89 0 0 0 941 315.88l-413.15-195.2a27.73 27.73 0 0 0-3.09-1.23 27.45 27.45 0 0 0-24.47-0.46L80.93 317.59a32.43 32.43 0 0 0-15.79 28.64v345.06c0 0.55 0 1.1 0.05 1.64a27.51 27.51 0 0 0 16.24 26.89l415.62 185.45a38.27 38.27 0 0 0 26.19-1.11l419.37-187.77a41.24 41.24 0 0 0 16.26-31.91zM512.29 174.16l122.16 57.71L270.8 394.7l-115.43-51.5z m354 167.24L509.43 501.18l-171.22-76.4 361.74-162z m-746.16 46.3L484.5 550.29v289.16L120.13 676.86zM539.5 548l364.37-163.17v288.64L539.5 836.62z" p-id="5431"></path></svg>',
        },
        title: "阿虚同学储物间",
        desc: "阿虚同学的储物间",
        link: "https://axutongxue.com/",
      },
      {
        icon: {
          svg: '<svg t="1737703285823" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4261" width="200" height="200"><path d="M786.3 698.4c111.9 111.9 136.3 193 101.3 228s-116.1 10.6-228-101.3-174.3-231.1-139.4-266 154.2 27.4 266.1 139.3z" fill="#FFAB47" p-id="4262"></path><path d="M848.9 956.8c-50.6 0-121.1-41.8-200.1-120.8-106.1-106.1-188.1-239-139.3-287.7 22.4-22.4 64.6-18.3 122.1 11.8 51.6 27 110.4 72.3 165.6 127.5 54.8 54.8 91.5 104.5 109.1 147.9 22.5 55.2 8.2 85.8-7.8 101.8-13.1 13.1-29.8 19.5-49.6 19.5z m-300.4-392c-8.5 0-14.3 2-17.4 5.1-21.9 21.9 20.5 125.5 139.3 244.3 106.3 106.2 180.2 127.5 206.3 101.3 17-17 10-46.6 1.1-68.5-15.9-39-51.3-86.7-102.4-137.8-53.1-53.1-109.2-96.4-158.1-122-31.6-16.5-54.3-22.4-68.8-22.4z" fill="#59285E" p-id="4263"></path><path d="M158.3 81.3s-86.9 43.4 5.4 208.1c0 0 181 257 358.3 325.8l48.9-56.1s-39.8-39.8-21.7-86.9L158.3 81.3z" fill="#88C3F5" p-id="4264"></path><path d="M522.1 630.5c-1.9 0-3.7-0.3-5.5-1C337 559.9 158.8 308.9 151.3 298.3c-0.3-0.4-0.6-0.9-0.8-1.3-40-71.3-53.1-130.7-39-176.5 11.8-38.3 39-52.3 40.1-52.9 5.9-2.9 13.1-1.8 17.7 2.9l390.9 390.9c4.3 4.3 5.7 10.7 3.5 16.4-14.2 36.9 17 69.2 18.3 70.6 5.6 5.7 5.9 14.8 0.7 20.9l-48.9 56.1c-3.1 3.3-7.4 5.1-11.7 5.1zM176.7 281.2c9.8 13.8 177.3 245.5 341 315.6l33.1-38c-11.5-15.7-28.3-46.4-19.1-82.3L156.9 101.6c-5.5 5.5-12.4 14.7-16.6 29-7.4 25.6-7.2 72.5 36.4 150.6z" fill="#59285E" p-id="4265"></path></svg>',
        },
        title: "小刀娱乐网",
        desc: "软件下载必备",
        link: "https://www.x6g.com/",
      },
      {
        icon: "/logo.png",
        title: "软件集合",
        desc: "全网软件合集",
        link: "https://www.kdocs.cn/l/crn8TrfU9bHv?R=L1MvMw%3D%3D",
        badge: {
          text: "全网软件",
          type: "warning",
        },
      },
      {
        icon: {
          svg: '<svg t="1737697540437" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="56977" width="200" height="200"><path d="M0 0m204.8 0l614.4 0q204.8 0 204.8 204.8l0 614.4q0 204.8-204.8 204.8l-614.4 0q-204.8 0-204.8-204.8l0-614.4q0-204.8 204.8-204.8Z" fill="#A28FFF" p-id="56978"></path><path d="M819.2 0H534.272A756.48 756.48 0 0 0 0 483.584V819.2a204.8 204.8 0 0 0 204.8 204.8h614.4a204.8 204.8 0 0 0 204.8-204.8V204.8a204.8 204.8 0 0 0-204.8-204.8z" fill="#A288FF" p-id="56979"></path><path d="M819.2 0h-3.84a755.2 755.2 0 0 0-539.392 1024H819.2a204.8 204.8 0 0 0 204.8-204.8V204.8a204.8 204.8 0 0 0-204.8-204.8z" fill="#A280FF" p-id="56980"></path><path d="M497.152 721.152A752.384 752.384 0 0 0 560.384 1024H819.2a204.8 204.8 0 0 0 204.8-204.8V204.8a204.8 204.8 0 0 0-89.088-168.96 755.2 755.2 0 0 0-437.76 685.312z" fill="#9F73FF" p-id="56981"></path><path d="M153.6 307.2m230.4 0l256 0q230.4 0 230.4 230.4l0 0q0 230.4-230.4 230.4l-256 0q-230.4 0-230.4-230.4l0 0q0-230.4 230.4-230.4Z" fill="#F0F0FF" p-id="56982"></path><path d="M384 307.2a230.4 230.4 0 0 0-110.336 432.384A228.352 228.352 0 0 0 307.2 742.4h256a230.4 230.4 0 0 0 110.336-432.384A228.352 228.352 0 0 0 640 307.2z" fill="#FFFFFF" p-id="56983"></path><path d="M336.384 460.8m25.6 0l0 0q25.6 0 25.6 25.6l0 102.4q0 25.6-25.6 25.6l0 0q-25.6 0-25.6-25.6l0-102.4q0-25.6 25.6-25.6Z" fill="#AFA4FF" p-id="56984"></path><path d="M285.184 563.2m0-25.6l0 0q0-25.6 25.6-25.6l102.4 0q25.6 0 25.6 25.6l0 0q0 25.6-25.6 25.6l-102.4 0q-25.6 0-25.6-25.6Z" fill="#AFA4FF" p-id="56985"></path><path d="M687.616 537.6m-51.2 0a51.2 51.2 0 1 0 102.4 0 51.2 51.2 0 1 0-102.4 0Z" fill="#AFA4FF" p-id="56986"></path><path d="M512 332.8a25.6 25.6 0 0 1-25.6-25.6v-51.2a137.984 137.984 0 0 1 40.96-97.792l51.2-51.2A25.6 25.6 0 1 1 614.4 141.824l-51.2 51.2a86.272 86.272 0 0 0-25.6 60.416v51.2a25.6 25.6 0 0 1-25.6 28.16z" fill="#FFFFFF" p-id="56987"></path></svg>',
        },
        title: "小叽资源",
        desc: "游戏Download",
        link: "https://steamzg.com/",
      },
      {
        icon: "/EkVzlR7i.png",
        title: "XD Game",
        desc: "游戏分享中心",
        link: "https://www.xdgame.com/",
      },
      {
        icon: "/jZLvxQE3.png",
        title: "游民星空",
        desc: "大型单机游戏门户",
        link: "https://www.gamersky.com/",
      },
    ],
  },
  {
    title: "后端学习",
    items: [
      {
        icon: {
          svg: '<svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" height="1em" width="1em"><path d="m21.66 10.44-.98 4.18c-.84 3.61-2.5 5.07-5.62 4.77-.5-.04-1.04-.13-1.62-.27l-1.68-.4c-4.17-.99-5.46-3.05-4.48-7.23l.98-4.19c.2-.85.44-1.59.74-2.2 1.17-2.42 3.16-3.07 6.5-2.28l1.67.39c4.19.98 5.47 3.05 4.49 7.23Z" fill="#c9d1d9"></path><path d="M15.06 19.39c-.62.42-1.4.77-2.35 1.08l-1.58.52c-3.97 1.28-6.06.21-7.35-3.76L2.5 13.28c-1.28-3.97-.22-6.07 3.75-7.35l1.58-.52c.41-.13.8-.24 1.17-.31-.3.61-.54 1.35-.74 2.2l-.98 4.19c-.98 4.18.31 6.24 4.48 7.23l1.68.4c.58.14 1.12.23 1.62.27Zm2.43-8.88c-.06 0-.12-.01-.19-.02l-4.85-1.23a.75.75 0 0 1 .37-1.45l4.85 1.23a.748.748 0 0 1-.18 1.47Z" fill="#228e6c"></path><path d="M14.56 13.89c-.06 0-.12-.01-.19-.02l-2.91-.74a.75.75 0 0 1 .37-1.45l2.91.74c.4.1.64.51.54.91-.08.34-.38.56-.72.56Z" fill="#228e6c"></path></svg>',
        },
        title: "Quick Reference",
        desc: "为了方便开发人员查阅技术栈，分享这份快速参考备忘清单【速查表】。",
        link: "https://quick-reference.wxy97.com/index.html",
      },
      {
        icon: "https://cdn.wxy97.com/blog/2024-07-10-ormeeemh.webp",
        title: "王旭阳个人博客",
        desc: "工欲善其事，必先利其器 🛠️",
        link: "https://www.wxy97.com/",
      },
      {
        icon: "https://cdn.tobebetterjavaer.com/tobebetterjavaer/images/logo.png",
        title: "二哥的Java进阶之路",
        desc: "沉默王二BB：这是一份通俗易懂、风趣幽默的Java学习指南",
        link: "https://javabetter.cn/",
      },
      {
        icon: "https://sf1-scmcdn-cn.feishucdn.com/obj/lark-reaction-cn/indigo_cloud.png",
        title: "微服务框架笔记",
        desc: "笔记",
        link: "https://b11et3un53m.feishu.cn/wiki/MWQIw4Zvhil0I5ktPHwcoqZdnec",
      },
      {
        icon: {
          svg: '<svg t="1737690418325" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="54807" width="200" height="200"><path d="M0 0m85.333333 0l853.333334 0q85.333333 0 85.333333 85.333333l0 853.333334q0 85.333333-85.333333 85.333333l-853.333334 0q-85.333333 0-85.333333-85.333333l0-853.333334q0-85.333333 85.333333-85.333333Z" fill="#FFFFFF" p-id="54808"></path><path d="M938.666667 0a85.333333 85.333333 0 0 1 85.333333 85.333333v853.333334a85.333333 85.333333 0 0 1-85.333333 85.333333H85.333333a85.333333 85.333333 0 0 1-85.333333-85.333333V85.333333a85.333333 85.333333 0 0 1 85.333333-85.333333h853.333334z m0 21.333333H85.333333a64 64 0 0 0-63.893333 60.245334L21.333333 85.333333v853.333334a64 64 0 0 0 60.245334 63.893333L85.333333 1002.666667h853.333334a64 64 0 0 0 63.893333-60.245334L1002.666667 938.666667V85.333333a64 64 0 0 0-60.245334-63.893333L938.666667 21.333333z" fill="#E9EBEE" p-id="54809"></path><path d="M560.533333 128c41.877333 97.749333-150.122667 157.632-168 239.125333-16.341333 74.752 113.749333 162.474667 113.877334 162.474667-19.84-30.933333-34.325333-57.024-54.144-105.258667-33.6-81.493333 204.714667-154.986667 108.266666-296.341333z m126.933334 135.701333s-167.893333 10.496-176.384 119.104c-3.882667 48.341333 44.309333 73.728 45.696 108.949334 1.216 28.714667-28.928 52.586667-28.928 52.586666s54.037333-9.664 70.933333-53.546666c18.688-48.682667-36.373333-81.92-30.784-120.96 5.376-37.226667 119.466667-106.112 119.466667-106.112z m41.066666 250.176c-17.621333-0.789333-37.44 5.674667-55.082666 18.453334 34.773333-7.594667 64.426667 13.973333 64.426666 38.805333 0 55.616-80.298667 107.989333-80.298666 107.989333s124.138667-13.738667 124.138666-105.216c0-37.76-23.893333-58.666667-53.184-60.053333v0.021333z m-329.450666 0.938667c-43.306667 1.493333-129.749333 8.533333-129.749334 41.557333 0 45.909333 201.386667 49.493333 345.344 21.226667 0 0 39.168-27.008 49.472-36.906667-94.4 19.349333-309.888 22.378667-309.888 5.504 0-15.445333 69.077333-31.36 69.077334-31.36s-9.813333-0.490667-24.256 0z m-13.098667 84.949333c-23.68 0-58.794667 18.218667-58.794667 35.968 0 35.776 178.304 63.253333 309.888 11.093334l-45.76-27.690667c-89.237333 28.864-254.101333 19.242667-205.333333-19.370667z m22.4 80.277334c-32.298667 0-53.205333 20.224-53.205333 35.093333 0 45.802667 193.109333 50.325333 269.738666 3.690667l-48.533333-31.402667c-57.173333 24.384-200.981333 27.946667-167.978667-7.381333z m-108.266667 41.557333c-52.693333-1.024-86.784 22.613333-86.784 42.453333 0 105.6 540.373333 100.522667 540.373334-7.381333 0-17.877333-21.333333-26.410667-28.906667-30.464 44.117333 103.168-441.472 95.104-441.472 34.133333 0-13.802667 35.946667-27.669333 69.077333-21.184l-27.989333-15.722666a179.989333 179.989333 0 0 0-24.298667-1.834667v0.021333zM810.666667 792.682667c-82.133333 78.592-290.005333 106.752-499.328 58.176 209.28 86.570667 498.261333 38.4 499.328-58.176z" fill="#3396FF" p-id="54810"></path></svg>',
        },
        title: "Java 全栈知识体系",
        desc: "包含: Java 基础, Java 部分源码, JVM, Spring, Spring Boot, Spring Cloud",
        link: "https://pdai.tech/",
      },
      {
        icon: "https://javaguide.cn/logo.svg",
        title: "JavaGuide",
        desc: "「Java学习 + 面试指南」涵盖 Java 程序员需要掌握的核心知识",
        link: "https://javaguide.cn/",
      },
      {
        icon: "https://doocs.github.io/advanced-java/images/icon.png",
        title: "互联网 Java 工程师进阶知识完全扫盲",
        desc: "互联网 Java 工程师进阶知识完全扫盲 - Doocs 技术社区",
        link: "https://doocs.github.io/advanced-java/#/",
      },
    ],
  },
  {
    title: "Vue 生态",
    items: [
      {
        icon: "https://cn.vuejs.org/logo.svg",
        title: "Vue 3",
        desc: "渐进式 JavaScript 框架",
        link: "https://cn.vuejs.org",
      },
      {
        icon: "https://cn.vuejs.org/logo.svg",
        title: "Vue 2",
        desc: "渐进式 JavaScript 框架",
        link: "https://v2.cn.vuejs.org",
      },
      {
        icon: "https://cn.vuejs.org/logo.svg",
        title: "Vue Router",
        desc: "Vue.js 的官方路由\n为 Vue.js 提供富有表现力、可配置的、方便的路由",
        link: "https://router.vuejs.org/zh",
      },
      {
        icon: "https://pinia.vuejs.org/logo.svg",
        title: "Pinia",
        desc: "符合直觉的 Vue.js 状态管理库",
        link: "https://pinia.vuejs.org/zh",
      },
      {
        icon: "https://nuxt.com/icon.png",
        title: "Nuxt.js",
        desc: "一个基于 Vue.js 的通用应用框架",
        link: "https://nuxt.com",
      },
      {
        icon: "https://vueuse.org/favicon.svg",
        title: "VueUse",
        desc: "Vue Composition API 的常用工具集",
        link: "https://vueuse.org",
      },
      {
        icon: "https://cn.vitejs.dev/logo.svg",
        title: "Vite",
        desc: "Vite 是一个超快速的前端构建工具，推动着下一代网络应用的发展",
        link: "https://cn.vitejs.dev/",
      },
      {
        icon: "https://vitepress.dev/vitepress-logo-mini.svg",
        title: "VitePress",
        desc: "VitePress由 Vite 和 Vue 驱动的静态站点生成器 Markdown 变成优雅的文档，只需几分钟",
        link: "https://vitepress.dev/zh/",
      },
      {
        icon: "https://vitepress.yiov.top/logo.png",
        title: "VitePress中文教程",
        desc: "VitePress快速上手中文教程 如果你也想搭建它，那跟我一起做吧",
        link: "https://vitepress.yiov.top/",
      },
      {
        icon: "https://app.tngeek.com/web/lew_ui/assets/static/logo-B03a2ktn.png",
        title: "Lew UI",
        desc: "少即是多美一个好看易用的 Vue3 组件库",
        link: "https://app.tngeek.com/web/lew_ui/#/",
      },
      {
        icon: "https://vue3-element-admin-site.midfar.com/home.png",
        title: "vue3-element-admin",
        desc: "vue3-element-admin 是一个后台前端解决方案，它基于 vue3 和 element-plus 实现。",
        link: "https://vue3-element-admin-site.midfar.com/zh/",
      },
      {
        icon: "https://element-plus.org/images/element-plus-logo-small.svg",
        title: "Element Plus",
        desc: "基于 Vue 3，面向设计师和开发者的组件库",
        link: "https://element-plus.org",
      },
      {
        icon: "/arco-design.png",
        title: "Arco design",
        desc: "字节跳动出品的企业级设计系统",
        link: "https://arco.design/",
        badge: {
          text: "Vue & React",
          type: "tip",
        },
      },
      {
        icon: "https://www.antdv.com/assets/logo.1ef800a8.svg",
        title: "Ant Design Vue",
        desc: "Ant Design 的 Vue 实现，开发和服务于企业级后台产品",
        link: "https://www.antdv.com/docs/vue/introduce-cn/",
      },
      {
        icon: "/customer_management_number_line.png",
        title: "NumberFlow",
        desc: "动画数字组件。无依赖性。访问。定制。",
        link: "https://number-flow.barvian.me/vue",
        badge: {
          text: "Vue & React",
          type: "tip",
        },
      },
    ],
  },
  {
    title: "移动端",
    items: [
      {
        icon: "https://camo.githubusercontent.com/496d30b5aaa2f015f3c738a8e664d265e19a2fc06acb926b131cd7488cf8b993/68747470733a2f2f646c2e64656e6f2e6a732e636e2f6275792d6d652d612d636f666665652d7765636861742e706e67",
        title: "微信小程序开发资源汇总",
        desc: "本文收集了微信小程序开发过程中会使用到的资料、问题以及第三方组件库。",
        link: "https://github.com/justjavac/awesome-wechat-weapp",
      },
      {
        icon: "https://res.wx.qq.com/a/wx_fed/assets/res/OTE0YTAw.png",
        title: "微信小程序文档",
        desc: "微信小程序官方开发者文档",
        link: "https://developers.weixin.qq.com/miniprogram/dev/framework/",
      },
      {
        icon: "https://docs.taro.zone/img/logo-taro.png",
        title: "Taro",
        desc: "Taro 3 可以支持转换到 H5、ReactNative 以及任意小程序平台。多端统一开发解决方案",
        link: "https://docs.taro.zone/docs/",
      },
      {
        icon: "https://web-assets.dcloud.net.cn/unidoc/zh/icon.png",
        title: "uni-app",
        desc: "一个使用 Vue.js 开发所有前端应用的框架",
        link: "https://uniapp.dcloud.net.cn",
      },
      {
        icon: "https://mpxjs.cn/favicon.ico",
        title: "Mpx",
        desc: "增强型跨端小程序框架",
        link: "https://mpxjs.cn",
      },
      {
        icon: "https://fastly.jsdelivr.net/npm/@vant/assets/logo.png",
        title: "Vant",
        desc: "轻量、可定制的移动端 Vue 组件库",
        link: "https://vant-ui.github.io/vant",
      },
      {
        icon: "https://webapp.didistatic.com/static/webapp/shield/Cube-UI_logo.ico",
        title: "Cube UI",
        desc: "基于 Vue.js 实现的精致移动端组件库",
        link: "https://didi.github.io/cube-ui",
      },
      {
        icon: "https://img14.360buyimg.com/imagetools/jfs/t1/167902/2/8762/791358/603742d7E9b4275e3/e09d8f9a8bf4c0ef.png",
        title: "NutUI",
        desc: "京东风格的轻量级移动端组件库",
        link: "https://nutui.jd.com",
      },
      {
        icon: "https://reactnative.cn/img/header_logo.svg",
        title: "React Native 中文网",
        desc: "React Native 中文网 · 使用React来编写原生应用的框架",
        link: "https://reactnative.cn/",
      },
      {
        icon: {
          svg: '<svg t="1737707912439" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="15215" width="200" height="200"><path d="M492.256 586.112l107.552-104.768h267.168l-236.672 236.672-138.048-131.904" fill="#40D0FD" p-id="15216"></path><path d="M157.024 516l134.368 137.568L866.976 73.184h-267.168L157.024 516z" fill="#41D0FD" p-id="15217"></path><path d="M357.632 719.328l136.288 134.272 136.384-135.584-138.048-131.904-134.624 133.216z" fill="#1FBCFD" p-id="15218"></path><path d="M493.92 853.6l136.384-135.584 233.344 236h-268.672l-101.056-100.416z" fill="#095A9D" p-id="15219"></path><path d="M493.92 853.6l127.072-42.272-42.816-41.504-84.256 83.776z" fill="#0E5199" p-id="15220"></path></svg>',
        },
        title: "Flutter",
        desc: "Flutter: 为所有屏幕创造精彩 - Flutter 中文开发者网站 - Flutter",
        link: "https://reactnative.cn/",
      },
    ],
  },
  {
    title: "前端素材",
    items: [
      {
        icon: "https://img.alicdn.com/imgextra/i4/O1CN01Z5paLz1O0zuCC7osS_!!6000000001644-55-tps-83-82.svg",
        title: "iconfont",
        desc: "国内功能很强大且图标内容很丰富的矢量图标库，提供矢量图标下载、在线存储、格式转换等功能",
        link: "https://www.iconfont.cn",
      },
      {
        icon: "https://lf1-cdn2-tos.bytegoofy.com/bydesign/iconparksite/logo.svg",
        title: "IconPark 图标库",
        desc: "IconPark图标库是一个通过技术驱动矢量图标样式的开源图标库，可以实现根据单一 SVG 源文件变换出多种主题",
        link: "https://iconpark.oceanengine.com/official",
      },
      {
        icon: "https://www.emojiall.com/logo-white.png",
        title: "Emoji 大全",
        desc: "Emoji 表情大全",
        link: "https://www.emojiall.com/zh-hans#google_vignette",
      },
      {
        icon: "https://lucide.dev/logo.light.svg",
        title: "Lucide",
        desc: "美丽 & 一致的图标",
        link: "https://lucide.dev/",
      },
      {
        icon: "https://www.mobanwang.com/images/logo.png",
        title: "模板王",
        desc: "10000+HTML网站模板免费下载",
        link: "https://www.mobanwang.com/",
      },
      {
        icon: {
          svg: '<svg t="1737705393717" class="icon" viewBox="0 0 1280 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11625" width="200" height="200"><path d="M1213.44 318.08H59.2c-58.56 0-61.504 28.544-58.368 63.424l52.48 573.184c3.2 34.88 11.52 63.36 70.016 63.36h1025.92c59.712 0 66.816-28.48 69.952-63.36l52.48-573.184c3.2-34.88 0.32-63.36-58.24-63.36z m-42.368-139.904c-7.04-28.032-41.664-50.944-76.928-50.944H660.48c-35.264 0-84.608-20.16-109.568-44.864L513.088 44.928C488.128 20.224 438.848 0 403.52 0H196.352c-35.2 0-67.328 28.48-71.168 63.232l-18.56 165.824h1077.248l-12.8-50.88z" fill="#F85959" p-id="11626"></path></svg>',
        },
        title: "站长素材",
        desc: "程序模板 网页模板 网站模板 个人网页模板 简历模板 个人网站模板 企业网站模板",
        link: "https://sc.chinaz.com/moban/",
      },
      {
        icon: {
          svg: '<svg t="1737705513874" class="icon" viewBox="0 0 4369 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="14210" width="200" height="200"><path d="M297.096533 819.2c163.703467 0 260.778667-80.554667 260.778667-215.995733 0-102.4-67.242667-175.991467-171.758933-189.371734V409.6c74.1376-13.312 132.846933-88.064 132.846933-167.936 0-115.234133-89.088-192.034133-220.842667-192.034133H6.417067V819.2h290.679466zM102.4 134.417067h173.8752c93.320533 0 145.6128 42.120533 145.6128 118.3744 0 83.217067-61.917867 128.546133-175.445333 128.546133H102.4V134.417067z m0 599.995733V464.008533h171.2128c122.6752 0 185.617067 45.329067 185.617067 134.417067 0 89.019733-60.8256 135.9872-176.5376 135.9872H102.4z m779.741867 94.4128c153.053867 0 256.546133-110.455467 256.546133-286.993067 0-177.015467-103.492267-286.9248-256.546133-286.9248-153.6 0-257.092267 109.909333-257.092267 286.993067 0 176.469333 103.492267 286.9248 257.092267 286.9248z m0-81.646933c-98.167467 0-162.679467-74.615467-162.679467-205.346134 0-130.6624 64.512-205.277867 162.679467-205.277866 98.0992 0 162.133333 74.615467 162.133333 205.346133 0 130.6624-64.034133 205.277867-162.133333 205.277867z m580.266666 81.646933c153.053867 0 256.546133-110.455467 256.546134-286.993067 0-177.015467-103.492267-286.9248-256.546134-286.9248-153.6 0-257.092267 109.909333-257.092266 286.993067 0 176.469333 103.492267 286.9248 257.092266 286.9248z m0-81.646933c-98.167467 0-162.679467-74.615467-162.679466-205.346134 0-130.6624 64.512-205.277867 162.679466-205.277866 98.0992 0 162.133333 74.615467 162.133334 205.346133 0 130.6624-64.034133 205.277867-162.133334 205.277867z m380.245334-616.448v133.802666h-82.602667v76.253867h82.602667v334.4384c0 106.632533 39.458133 148.206933 141.312 148.206933 21.845333 0 47.5136-1.570133 58.709333-4.232533v-77.824a361.813333 361.813333 0 0 1-38.434133 2.594133c-47.445333 0-68.744533-22.869333-68.744534-73.591466V340.7872h107.7248V264.533333h-107.7248v-133.802666h-92.842666z m290.133333 286.856533c0 80.008533 50.653867 128.546133 155.2384 153.6l87.995733 21.367467c63.488 15.428267 85.333333 38.365867 85.333334 78.370133 0 50.176-46.421333 82.1248-121.6512 82.1248-75.1616 0-117.828267-30.378667-129.024-93.866667h-92.842667c10.717867 104.0384 91.7504 169.642667 221.866667 169.642667 123.767467 0 214.971733-68.266667 214.971733-164.795733 0-79.530667-40.5504-123.221333-152.507733-150.459734l-88.064-21.2992c-61.8496-14.9504-90.112-41.096533-90.112-79.4624 0-48.5376 44.782933-82.1248 112.571733-82.1248 68.266667 0 110.933333 35.703467 117.828267 93.866667h88.541866c-3.754667-98.167467-84.7872-169.642667-206.370133-169.642667-120.0128 0-203.776 67.7888-203.776 162.679467z m548.2496-286.9248v133.870933h-82.602667v76.253867h82.602667v334.4384c0 106.632533 39.5264 148.206933 141.312 148.206933 21.9136 0 47.5136-1.570133 58.709333-4.232533v-77.824a361.540267 361.540267 0 0 1-38.365866 2.594133c-47.5136 0-68.8128-22.869333-68.8128-73.591466V340.7872h107.7248V264.533333h-107.7248v-133.802666h-92.842667zM2980.795733 819.2h92.842667V473.565867c0-78.370133 46.8992-130.116267 118.920533-130.116267 22.391467 0 42.120533 2.730667 49.5616 5.3248V258.730667c-7.509333-1.092267-21.2992-3.754667-37.341866-3.754667-65.058133 0-116.258133 38.912-134.3488 100.352h-2.184534V264.465067h-87.381333V819.2z m488.516267 9.557333c74.683733 0 145.066667-41.5744 178.176-104.994133h2.048V819.2h88.064V435.746133c0-110.3872-82.1248-180.8384-212.309333-180.8384-131.140267 0-213.265067 73.659733-219.682134 169.642667h89.565867c11.741867-54.408533 56.5248-88.064 128-88.064 76.8 0 121.6512 40.5504 121.6512 108.3392v46.421333l-158.9248 9.0112c-128.068267 7.509333-201.1136 67.1744-201.1136 162.133334 0 99.7376 74.1376 166.434133 184.5248 166.434133z m20.821333-78.916266c-66.696533 0-110.933333-34.6112-110.933333-87.381334 0-52.360533 42.666667-85.333333 117.3504-90.180266l148.2752-9.079467v45.329067c0 80.008533-67.242667 141.312-154.692267 141.312z m634.6752-494.933334c-80.554667 0-145.066667 41.096533-179.2 103.492267h-2.116266V264.533333h-88.064v739.7376h92.842666V729.088h2.116267c33.109333 60.757333 97.0752 99.669333 176.5376 99.669333 139.741867 0 235.178667-113.0496 235.178667-286.9248 0-173.806933-95.982933-286.9248-237.294934-286.9248z m-18.158933 492.270934c-94.890667 0-158.9248-81.578667-158.9248-205.346134 0-123.153067 64.034133-205.277867 158.9248-205.277866 98.7136 0 160.5632 80.008533 160.5632 205.346133 0 125.815467-61.8496 205.277867-160.5632 205.277867z" fill="#9B51E0" p-id="14211"></path></svg>',
        },
        title: "Bootstrap模板库",
        desc: "Bootstrap模板_响应式网站模板",
        link: "https://www.bootstrapmb.com/",
      },
    ],
  },
  {
    title: "React 生态",
    items: [
      {
        icon: "https://zh-hans.reactjs.org/favicon.ico",
        title: "React",
        desc: "用于构建用户界面的 JavaScript 库",
        link: "https://zh-hans.reactjs.org",
      },
      {
        icon: "https://reactrouter.com/favicon-light.png",
        title: "React Router",
        desc: "React 的声明式路由",
        link: "https://reactrouter.com",
      },
      {
        icon: "https://nextjs.org/static/favicon/safari-pinned-tab.svg",
        title: "Next.js",
        desc: "一个用于 Web 的 React 框架",
        link: "https://nextjs.org",
      },
      {
        icon: "https://img.alicdn.com/tfs/TB1YHEpwUT1gK0jSZFhXXaAtVXa-28-27.svg",
        title: "UmiJS",
        desc: "插件化的企业级前端应用框架",
        link: "https://umijs.org",
      },
      {
        icon: "https://gw.alipayobjects.com/zos/rmsportal/rlpTLlbMzTNYuZGGCVYM.png",
        title: "Ant Design",
        desc: "一套企业级 UI 设计语言和 React 组件库",
        link: "https://ant-design.antgroup.com/index-cn",
      },
      {
        icon: "/semi-design.png",
        title: "semi.design",
        desc: "由抖音前端与 UED 团队维护，易于定制的现代化设计系统，帮助设计师与开发者打造高质量产品。",
        link: "https://semi.design/zh-CN/",
        badge: {
          text: "React",
          type: "tip",
        },
      },
      {
        icon: "/Sh12097374834123.png",
        title: "shadcn/ui",
        desc: "设计精美的组件，您可以将其复制并粘贴到您的应用程序中。使用 Tailwind CSS 制作。开源。",
        link: "https://ui.shadcn.com/",
        badge: {
          text: "React",
          type: "tip",
        },
      },
      {
        icon: "https://gw.alipayobjects.com/zos/bmw-prod/69a27fcc-ce52-4f27-83f1-c44541e9b65d.svg",
        title: "Ant Design Mobile",
        desc: "构建移动 WEB 应用程序的 React 组件库",
        link: "https://mobile.ant.design",
      },
      {
        icon: "https://docs.pmnd.rs/apple-touch-icon.png",
        title: "Zustand",
        desc: "一个小型、快速、可扩展的 React 状态管理解决方案",
        link: "https://docs.pmnd.rs/zustand/getting-started/introduction",
      },
      {
        icon: "https://valtio.pmnd.rs/favicon.ico",
        title: "Valtio",
        desc: "makes proxy-state simple for React and Vanilla",
        link: "https://valtio.pmnd.rs",
      },
      {
        icon: "https://jotai.org/favicon.svg",
        title: "Jotai",
        desc: "primitive and flexible state management for React",
        link: "https://jotai.org",
      },
      {
        icon: "https://cn.redux.js.org/img/redux.svg",
        title: "Redux",
        desc: "JavaScript 应用的状态容器，提供可预测的状态管理",
        link: "https://cn.redux.js.org",
      },
      {
        icon: "https://zh.mobx.js.org/assets/mobx.png",
        title: "MobX",
        desc: "一个小型、快速、可扩展的 React 状态管理解决方案",
        link: "https://zh.mobx.js.org",
      },
      {
        icon: "https://ahooks.js.org/simple-logo.svg",
        title: "ahooks",
        desc: "一套高质量可靠的 React Hooks 库",
        link: "https://ahooks.js.org/zh-CN",
      },
    ],
  },
  {
    title: "前端学习",
    items: [
      {
        icon: {
          svg: '<svg id="mdn-docs-logo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 361 104.2" style="enable-background:new 0 0 361 104.2" xml:space="preserve" role="img"><title>MDN Web Docs</title><path d="M197.6 73.2h-17.1v-5.5h3.8V51.9c0-3.7-.7-6.3-2.1-7.9-1.4-1.6-3.3-2.3-5.7-2.3-3.2 0-5.6 1.1-7.2 3.4s-2.4 4.6-2.5 6.9v15.6h6v5.5h-17.1v-5.5h3.8V51.9c0-3.8-.7-6.4-2.1-7.9-1.4-1.5-3.3-2.3-5.6-2.3-3.2 0-5.5 1.1-7.2 3.3-1.6 2.2-2.4 4.5-2.5 6.9v15.8h6.9v5.5h-20.2v-5.5h6V42.4h-6.1v-5.6h13.4v6.4c1.2-2.1 2.7-3.8 4.7-5.2 2-1.3 4.4-2 7.3-2s5.3.7 7.5 2.1c2.2 1.4 3.7 3.5 4.5 6.4 1.1-2.5 2.7-4.5 4.9-6.1s4.8-2.4 7.9-2.4c3.5 0 6.5 1.1 8.9 3.3s3.7 5.6 3.7 10.2v18.2h6.1v5.5zm42.5 0h-13.2V66c-1.2 2.2-2.8 4.1-4.9 5.6-2.1 1.6-4.8 2.4-8.3 2.4-4.8 0-8.7-1.6-11.6-4.9-2.9-3.2-4.3-7.7-4.3-13.3 0-5 1.3-9.6 4-13.7 2.6-4.1 6.9-6.2 12.8-6.2s9.8 2.2 12.3 6.5V22.7h-8.6v-5.6h15.8v50.6h6v5.5zm-13.3-16.8V52c-.1-3-1.2-5.5-3.2-7.3s-4.4-2.8-7.2-2.8c-3.6 0-6.3 1.3-8.2 3.9-1.9 2.6-2.8 5.8-2.8 9.6 0 4.1 1 7.3 3 9.5s4.5 3.3 7.4 3.3c3.2 0 5.8-1.3 7.8-3.8 2.1-2.6 3.1-5.3 3.2-8zm61.5 16.8H269v-5.5h6V51.9c0-3.7-.7-6.3-2.2-7.9-1.4-1.6-3.4-2.3-5.7-2.3-3.1 0-5.6 1-7.4 3s-2.8 4.4-2.9 7v15.9h6v5.5h-19.3v-5.5h6V42.4h-6.2v-5.6h13.6V43c2.6-4.6 6.8-6.9 12.7-6.9 3.6 0 6.7 1.1 9.2 3.3s3.7 5.6 3.7 10.2v18.2h6v5.4h-.2z" class="logo-text"></path><path d="M42 .2 13.4 92.3H1.7L30.2.2Zm10.4 0v92.1H42V.2Zm40.3 0L64.2 92.3H52.5L81 .2Zm10.4 0v92.1H92.7V.2Z" class="logo-m"></path><path d="M294 95h67v8.8h-67z" class="logo-_"></path></svg>',
        },
        title: "MDN | Web 开发者指南",
        desc: "Mozilla 的开发者平台，提供了大量关于 HTML、CSS 和 JavaScript 的详细文档",
        link: "https://developer.mozilla.org/zh-CN",
      },
      {
        icon: {
          svg: '<svg t="1737684905207" class="icon" viewBox="0 0 8964 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="21540" width="200" height="200"><path d="M2688.897616 566.934081c90.120617 115.253857 44.162693 251.332398 52.779803 376.639552 3.231417 48.471248-31.596073 56.01122-71.809256 54.934081-68.218794 0-136.078541 15.798036-179.523142-71.809257-77.913043-151.517532-169.110799-296.213184-255.640954-443.42216-19.747546-33.750351-24.415147-80.426367-71.809256-90.479663a101.610098 101.610098 0 0 1-71.809257-110.586255 179.523142 179.523142 0 0 0-46.676017-128.897616c-25.851332-32.314165-101.251052-40.57223-65.346423-103.40533 22.978962-38.417952 76.117812-18.31136 115.253857-25.492286 207.169705-35.904628 347.915849 32.314165 424.392706 235.534362 35.904628 96.942496 96.58345 184.54979 146.131838 276.465638a40.213184 40.213184 0 0 1 24.056101 30.518934zM966.911641 69.295933A124.58906 124.58906 0 0 1 1081.447405 27.287518c107.713885 0 232.661992-33.391304 315.96073 11.130434 112.381487 60.319776-48.471248 150.440393-25.851333 251.332399 30.518934 135.360449 7.539972 282.569425 7.539972 424.751753 0 53.13885-5.026648 107.713885 30.159888 153.671809 29.441795 38.776999 98.019635 69.295933 44.162693 129.974755-40.57223 48.112202-99.45582 15.798036-151.158485 7.180925-174.137447-27.646564-258.513324-128.538569-256.718093-303.753155v-337.14446c0-113.099579 31.596073-223.326788-78.631136-295.136045z" fill="#333333" p-id="21541"></path><path d="M6486.530154 1005.329593a442.704067 442.704067 0 0 1-107.713885-42.367461c-204.297335-133.565217-220.813464-340.734923-197.475456-552.57223a439.113604 439.113604 0 0 1 298.008416-385.974755c38.058906-14.002805 78.27209-43.4446 113.458625 0 26.928471 31.955119-2.154278 62.474053-11.130435 95.865358-71.809257 262.103787-83.657784 526.002805 5.385695 787.029453 11.848527 35.904628 29.800842 65.70547 6.103786 98.019635s-54.215989 7.899018-106.636746 0zM7339.98317 1.795231c67.500701 3.949509 90.83871 26.569425 69.654979 101.251052a1431.158485 1431.158485 0 0 0 3.231416 825.806452c23.338008 75.399719-5.026648 99.096774-76.476858 87.966339a311.652174 311.652174 0 0 1-50.984572-16.157082c-175.214586-66.782609-279.697055-251.332398-279.697055-491.893409s105.200561-420.084151 287.237027-486.86676z" fill="#96B97D" p-id="21542"></path><path d="M3741.262272 519.539972c0 248.100982-107.713885 426.187938-287.237027 480.762973-31.955119 9.69425-76.117812 21.901823-98.737727 7.539972-30.518934-19.388499-15.079944-62.8331-6.462834-98.378681a1759.326788 1759.326788 0 0 0 2.872371-798.877981c-7.539972-35.904628-22.978962-71.809257 3.231416-97.660589s65.346424-6.821879 98.737728 5.026648c188.858345 65.70547 289.032258 240.56101 287.596073 501.587658zM4674.423562 517.744741c0 239.483871-98.019635 415.057504-267.848527 477.531556-35.904628 13.643759-90.479663 30.159888-115.971949 14.002805-35.904628-22.619916-8.617111-71.809257 0-112.02244a1916.948107 1916.948107 0 0 0-2.513324-784.157083c-7.899018-35.904628-24.774194-71.809257 0-97.660589s64.987377-8.617111 98.019635 2.513324c186.345021 62.8331 289.750351 240.920056 288.314165 499.792427z" fill="#363636" p-id="21543"></path><path d="M7867.42216 502.664797c0 264.617111-107.713885 445.576438-289.032258 502.664796-89.761571 27.646564-123.511921 11.130435-100.53296-88.325385a1994.143058 1994.143058 0 0 0 4.667602-807.854138c-6.462833-35.904628-20.824684-71.809257 11.130435-96.224404s67.859748 0 101.610098 12.925666c175.573633 69.654979 272.157083 235.893408 272.157083 476.813465z" fill="#97B97E" p-id="21544"></path><path d="M2876.678822 500.151473c2.154278-238.765778 112.740533-419.725105 294.058906-481.12202 38.776999-13.284712 77.553997-35.904628 111.663394 7.539972 20.106592 26.569425 10.053296 47.394109 0 77.913043-94.429173 251.332398-31.237027 510.922861-35.904628 766.922862 0 39.136045 64.628331 87.966339 8.258064 120.280505a149.004208 149.004208 0 0 1-151.517531-19.3885c-171.265077-112.740533-226.558205-278.619916-226.558205-472.145862zM3810.199158 495.124825c2.513324-235.534362 118.485273-420.802244 298.367462-478.608696 35.904628-11.130435 68.936886-28.723703 99.096774 0a62.8331 62.8331 0 0 1 14.720898 78.27209c-110.945302 254.204769-35.904628 520.258065-41.290323 780.925666 0 33.750351 56.729313 74.322581 15.798037 107.713885s-99.45582 24.415147-148.645162-5.026648c-184.908836-111.304348-240.56101-282.928471-238.047686-483.276297z" fill="#343434" p-id="21545"></path><path d="M1567.596073 58.165498C1608.527349 11.130435 1659.511921 27.287518 1704.392707 27.287518c52.779804 0 128.897616-11.130435 154.030855 17.952314 50.26648 57.806452-44.521739 79.708275-62.115007 125.307153-57.447405 150.081346-20.106592 305.548387-25.492286 458.502103-4.308555 127.102384 2.154278 251.332398-119.562412 335.708275-42.008415 28.723703-90.83871 79.349229-133.565217 22.978962-30.87798-40.57223 0-83.657784 52.779803-109.868162A167.674614 167.674614 0 0 0 1665.615708 718.092567c0-154.748948-5.744741-310.215989 3.949509-464.605891 3.590463-91.556802-93.352034-120.639551-101.969144-195.321178z" fill="#3A3A3A" p-id="21546"></path><path d="M2090.008415 282.569425c24.056101 35.904628 48.112202 71.809257 71.809257 110.586255 29.441795 177.368864-81.14446 377.357644 92.992987 532.824685 28.723703 25.851332 6.462833 68.218794-41.649369 71.809256-65.346424 2.513324-130.692847 3.590463-195.680224 0-38.776999 0-81.862553-31.237027-47.394109-64.987377 152.953717-149.363254 64.628331-335.708275 90.479663-502.664797 7.539972-49.548387-29.800842-106.995792 29.441795-147.568022z" fill="#404040" p-id="21547"></path><path d="M8952.819074 903.001403c-89.761571-277.901823-65.346424-558.316971 2.872371-854.530155-374.126227-66.782609-373.767181-66.782609-375.921459 304.112202 0 167.315568 54.215989 365.509116-17.593268 490.457223-124.948107 215.42777 19.029453 151.517532 114.894811 156.54418 71.809257 3.949509 147.208976 0 215.42777 0s86.530154-17.234222 60.319775-96.58345z" fill="#9FBF89" p-id="21548"></path><path d="M8548.532959 285.441795a420.802244 420.802244 0 0 0-12.925666-58.88359c-30.518934 43.4446-52.420757 74.681627-77.194951 110.586255C8334.182328 20.824684 8334.182328 20.106592 8079.618513 29.800842c-40.57223 0-100.532959 0-116.690042 21.542777-40.57223 59.242637 40.931276 71.809257 60.319776 107.713885 27.287518 52.061711 45.598878 107.713885 67.859747 164.084151-64.987377 67.141655-44.162693 153.312763-46.31697 236.252454-3.949509 94.070126 11.848527 194.603086-16.875175 280.774194-55.293128 165.879383-56.370266 172.342216 119.921458 162.28892 114.535764-6.462833 124.58906-30.159888 50.26648-122.793829s-76.117812-199.98878-10.053296-303.753156c12.925666 124.948107 73.604488 235.534362 107.713885 354.378682 8.617111 30.87798 19.388499 61.755961 55.293128 57.447405a71.809257 71.809257 0 0 0 45.598877-47.753155c50.625526-216.504909 167.315568-421.16129 151.876578-654.541375z" fill="#9FBF89" p-id="21549"></path><path d="M6963.343619 186.704067v129.615709c0 35.904628-3.949509 78.631136-42.726508 89.043478s-60.319776-29.082749-75.758766-61.037868c-23.338008-47.394109-31.596073-110.586255-68.218794-143.618514-143.618513-123.511921-222.249649-174.85554 63.192146-183.47265 225.840112-5.026648 62.8331 146.131837 123.511922 169.469845z" fill="#9DBD86" p-id="21550"></path><path d="M6065.009818 867.096774a155.826087 155.826087 0 0 1-143.618514 153.312763c-100.532959 10.412342-156.185133-64.628331-159.057503-151.876578a141.105189 141.105189 0 0 1 136.078541-143.618513h13.643759c84.734923-3.590463 138.950912 51.343619 152.953717 142.182328z" fill="#9BBC84" p-id="21551"></path><path d="M2688.897616 566.934081l-24.056101-28.723702c-51.343619-143.618513 54.215989-323.141655-101.251052-447.012623-31.596073-25.492286 4.667602-63.910238 48.471248-64.628331h179.523142c43.085554 0 80.785414 35.904628 49.548387 65.346424-128.179523 120.639551-86.171108 274.31136-96.58345 417.929873a55.652174 55.652174 0 0 1-54.215989 57.088359z" fill="#474747" p-id="21552"></path><path d="M6961.548387 767.640954c-5.385694 107.713885-179.523142 261.026648-265.335203 251.332398a59.242637 59.242637 0 0 1-42.367462-22.978962 57.088359 57.088359 0 0 1 19.747546-78.27209 388.129032 388.129032 0 0 0 189.217391-179.523142 49.189341 49.189341 0 0 1 63.910239-24.774193 55.652174 55.652174 0 0 1 11.489481 7.180926c15.079944 12.56662 20.106592 38.776999 23.338008 47.035063z" fill="#9CBD85" p-id="21553"></path><path d="M843.758766 799.237027c-10.771388-2.513324-10.771388-54.215989-10.771389-83.298738-2.513324-97.301543-58.88359-157.621318-143.618513-197.834502 198.911641-187.42216 185.267882-397.464236-22.619916-469.273492a493.68864 493.68864 0 0 0-229.789621-15.798037c2.513324 28.00561 3.590463 56.01122 5.026648 84.01683 20.465638 45.598878 61.755961 85.453015 66.782608 140.387097 11.848527 110.227209-59.960729 190.653576-71.809256 287.237027a135.719495 135.719495 0 0 1 0 26.928471c113.458626 77.194951 51.343619 197.834502 71.809256 297.649369a179.523142 179.523142 0 0 0 157.262273 147.568022 227.99439 227.99439 0 0 0 238.765778-86.171108c57.447405-76.476858 16.516129-110.945302-61.037868-131.410939z" fill="#343434" p-id="21554"></path><path d="M404.645161 569.806452C378.793829 392.796634 394.232819 215.42777 394.950912 38.058906 260.308555 25.492286 126.025245 13.643759 0 44.162693a1249.481066 1249.481066 0 0 1 35.904628 753.997195c-75.040673 290.468443 94.788219 191.012623 215.42777 200.347826a1202.446003 1202.446003 0 0 0 160.852735 0c57.088359-2.87237 81.862553-44.880785 42.726508-80.785414-113.458626-106.995792-47.394109-230.148668-50.26648-347.915848z" fill="#363636" p-id="21555"></path><path d="M5453.194951 486.86676c158.339411-62.115007 189.576438-176.291725 152.235624-304.471248S5451.399719 32.673212 5334.709677 27.646564c-41.290323 0-82.939691 3.231417-124.230014 5.385694a244.151473 244.151473 0 0 0-2.513324 31.955119c5.744741 42.008415 50.26648 66.423562 61.037869 102.328191 30.518934 104.841515 60.678822 219.736325-64.987378 294.776999 130.692847 175.932679 97.301543 354.019635 8.976157 532.824684v3.231417c160.493689 0 334.990182 20.106592 406.799439-170.546985 55.293128-148.286115-15.079944-261.026648-166.597475-340.734923z" fill="#343434" p-id="21556"></path><path d="M5168.471248 35.904628c-134.28331-10.771388-269.284712-23.338008-421.520336 12.56662a347.197756 347.197756 0 0 1 78.631136 251.332399c-5.385694 136.078541-29.082749 280.415147 6.821879 406.799439 31.237027 111.304348-140.746143 217.582048-20.465638 279.338008 93.71108 48.112202 232.661992 7.539972 351.506311 7.539972l15.079944-532.465638c-28.364656-140.02805-5.744741-281.492286-10.053296-425.1108z" fill="#373737" p-id="21557"></path></svg>',
        },
        title: "菜鸟教程",
        desc: "学的不仅是技术，更是梦想！",
        link: "https://www.runoob.com",
      },
      {
        icon: "https://es6.ruanyifeng.com/images/cover_thumbnail_3rd.jpg",
        title: "ES6 入门教程",
        desc: "阮一峰的网络日志",
        link: "http://es6.ruanyifeng.com",
      },
      {
        icon: {
          svg: '<svg t="1737685023462" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="22546" width="200" height="200"><path d="M0 512v512h1024V0H0z m825.216-40.789333c26.026667 6.485333 45.824 18.048 64.042667 36.906666 9.429333 10.069333 23.424 28.416 24.533333 32.853334 0.341333 1.28-44.202667 31.146667-71.168 47.914666-0.981333 0.64-4.906667-3.584-9.258667-10.069333-13.226667-19.2-27.008-27.477333-48.128-28.928-31.061333-2.133333-51.029333 14.122667-50.858666 41.258667a37.546667 37.546667 0 0 0 4.352 19.2c6.826667 14.122667 19.541333 22.613333 59.306666 39.808 73.344 31.573333 104.704 52.352 124.202667 81.92 21.76 32.981333 26.666667 85.674667 11.861333 124.842666-16.213333 42.581333-56.533333 71.509333-113.28 81.066667-17.536 3.114667-59.136 2.645333-77.994666-0.768-41.130667-7.338667-80.128-27.648-104.192-54.314667-9.429333-10.368-27.818667-37.546667-26.666667-39.466666a67.413333 67.413333 0 0 1 9.386667-6.016c4.608-2.602667 21.802667-12.544 38.058666-21.973334l29.44-17.066666 6.186667 9.130666c8.618667 13.141333 27.434667 31.189333 38.826667 37.205334 32.682667 17.237333 77.525333 14.805333 99.626666-5.034667a37.674667 37.674667 0 0 0 13.354667-30.72c0-11.861333-1.493333-17.066667-7.68-26.026667-7.936-11.349333-24.192-20.906667-70.357333-40.96-52.821333-22.741333-75.562667-36.864-96.384-59.306666a135.04 135.04 0 0 1-28.117334-51.2c-3.882667-14.464-4.864-50.730667-1.792-65.322667 10.88-51.072 49.408-86.613333 105.002667-97.194667 18.048-3.413333 59.989333-2.133333 77.696 2.261334z m-240.384 42.752l0.341333 41.941333H451.84v378.709333H357.546667v-378.709333H224.341333v-41.130667c0-22.784 0.469333-41.813333 1.109334-42.24 0.512-0.682667 81.621333-1.024 179.925333-0.853333l178.986667 0.512z" fill="#1296db" p-id="22547"></path></svg>',
        },
        title: "TypeScript 入门教程",
        desc: "从 JavaScript 程序员的角度总结思考，循序渐进的理解 TypeScript。",
        link: "https://ts.xcatliu.com/",
      },
      {
        icon: {
          svg: '<svg t="1737701230685" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="63174" width="200" height="200"><path d="M89.088 59.392l62.464 803.84c1.024 12.288 9.216 22.528 20.48 25.6L502.784 993.28c6.144 2.048 12.288 2.048 18.432 0l330.752-104.448c11.264-4.096 19.456-14.336 20.48-25.6l62.464-803.84c1.024-17.408-12.288-31.744-29.696-31.744H118.784c-17.408 0-31.744 14.336-29.696 31.744z" fill="#D3B900" p-id="63175"></path><path d="M512 120h350l-62 720-288 80" fill="#FFDA00" p-id="63176"></path><path d="M511 0l2 1024h-2z" fill="#FF0000" p-id="63177"></path><path d="M400 190h70v614l-240-80v-70l170 50zM830 190H550v380l180-30-20 160-160 30v70l220-46 28-280-190 24V258h214z" fill="#FFFFFF" p-id="63178"></path></svg>',
        },
        title: "JavaScript 教程",
        desc: "本教程全面介绍 JavaScript 核心语法，覆盖了 ES5 和 DOM 规范的所有内容。",
        link: "https://wangdoc.com/javascript/",
      },
      {
        icon: {
          svg: '<svg t="1737685365723" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="37663" width="200" height="200"><path d="M108.544 313.344h808.96v604.16H108.544z" fill="#FFEA00" p-id="37664"></path><path d="M387.072 632.832c-4.096 28.672-10.24 57.344-14.336 88.064h-2.048c-6.144-30.72-12.288-59.392-18.432-88.064l-34.816-143.36h-38.912l-34.816 143.36c-6.144 28.672-12.288 59.392-18.432 88.064h-2.048l-14.336-88.064-26.624-143.36H139.264l55.296 274.432H245.76l36.864-151.552c4.096-22.528 8.192-43.008 12.288-63.488h2.048c4.096 20.48 8.192 40.96 12.288 63.488l36.864 151.552h53.248l53.248-274.432h-40.96l-24.576 143.36z m135.168 6.144h100.352v-36.864h-100.352v-75.776h118.784v-36.864h-161.792v274.432h165.888v-36.864h-122.88v-88.064zM942.08 204.8H81.92c-45.056 0-81.92 36.864-81.92 81.92v655.36c0 45.056 36.864 81.92 81.92 81.92h860.16c45.056 0 81.92-36.864 81.92-81.92V286.72c0-45.056-36.864-81.92-81.92-81.92z m20.48 716.8c0 22.528-18.432 40.96-40.96 40.96H102.4c-22.528 0-40.96-18.432-40.96-40.96V307.2c0-22.528 18.432-40.96 40.96-40.96h819.2c22.528 0 40.96 18.432 40.96 40.96v614.4z m-139.264-303.104c24.576-10.24 38.912-34.816 38.912-61.44 0-49.152-40.96-67.584-96.256-67.584h-83.968v274.432h92.16c61.44 0 104.448-26.624 104.448-79.872 0-36.864-22.528-59.392-55.296-65.536z m-98.304-94.208h38.912c38.912 0 57.344 10.24 57.344 38.912 0 26.624-18.432 40.96-59.392 40.96h-36.864v-79.872z m43.008 206.848h-43.008v-92.16h43.008c43.008 0 67.584 14.336 67.584 45.056 0 30.72-24.576 47.104-67.584 47.104zM993.28 0h-962.56C14.336 0 0 14.336 0 30.72v102.4C0 149.504 14.336 163.84 30.72 163.84h962.56c16.384 0 30.72-14.336 30.72-30.72v-102.4c0-16.384-14.336-30.72-30.72-30.72z" fill="" p-id="37665"></path></svg>',
        },
        title: "网道（WangDoc.com）",
        desc: "是一个文档网站，提供互联网开发文档",
        link: "https://wangdoc.com/",
      },
      {
        icon: {
          svg: '<svg t="1737690275544" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="53678" width="200" height="200"><path d="M880 176h-297.6l-67.2 134.4H140.8v537.6h806.4v-672z m0 134.4h-262.4l35.2-67.2h227.2z" fill="#007ACC" p-id="53679"></path><path d="M871.968 557.952a113.856 113.856 0 0 1 57.184 32.96 150.592 150.592 0 0 1 21.92 29.312c0.288 1.152-39.488 27.872-63.584 42.816-0.864 0.576-4.352-3.2-8.288-8.992a51.84 51.84 0 0 0-42.976-25.856c-27.712-1.888-45.568 12.64-45.44 36.864a33.536 33.536 0 0 0 3.904 17.12c6.112 12.64 17.408 20.192 52.992 35.552 65.472 28.16 93.504 46.752 110.912 73.152a132.704 132.704 0 0 1 10.592 111.488 122.592 122.592 0 0 1-101.184 72.448 280.384 280.384 0 0 1-69.696-0.736 168.064 168.064 0 0 1-93.056-48.48 161.568 161.568 0 0 1-23.808-35.2 68.32 68.32 0 0 1 8.416-5.376c4.064-2.336 19.456-11.168 33.984-19.584l26.272-15.232 5.504 8.128a122.784 122.784 0 0 0 34.784 33.216 84.928 84.928 0 0 0 88.992-4.512 39.744 39.744 0 0 0 5.088-50.656c-7.104-10.176-21.632-18.72-62.848-36.576a226.336 226.336 0 0 1-86.08-52.992 120.608 120.608 0 0 1-25.12-45.728 183.136 183.136 0 0 1-1.6-58.368 111.456 111.456 0 0 1 93.792-86.816 231.648 231.648 0 0 1 69.344 2.048z m-214.72 38.176l0.288 37.44h-119.04V971.84H454.4V633.6h-119.04v-36.736a359.904 359.904 0 0 1 1.024-37.76c0.448-0.576 72.864-0.864 160.704-0.736l159.84 0.448z" fill="#FFFFFF" p-id="53680"></path><path d="M837.536 992a269.44 269.44 0 0 1-41.888-2.784 183.776 183.776 0 0 1-101.664-53.28c-15.68-17.376-32.896-40.672-25.6-53.152a36.768 36.768 0 0 1 13.984-10.912c4.192-2.4 19.552-11.232 33.984-19.616l38.56-22.4 13.504 19.872a110.336 110.336 0 0 0 29.216 28.32 70.656 70.656 0 0 0 71.648-2.336 18.656 18.656 0 0 0 6.816-16 19.2 19.2 0 0 0-4.128-14.56 156.8 156.8 0 0 0-56.384-31.232 240 240 0 0 1-91.2-56.64 136.16 136.16 0 0 1-28.8-52.128 196.16 196.16 0 0 1-1.824-65.472 127.424 127.424 0 0 1 105.984-98.88 243.712 243.712 0 0 1 75.904 2.208 130.016 130.016 0 0 1 64.512 37.184 158.464 158.464 0 0 1 25.6 36.096c2.88 11.2 3.52 13.856-70.4 59.648l-5.056 3.2-6.176-1.056c-5.152-0.992-9.92-3.904-17.76-15.488a36.832 36.832 0 0 0-31.392-19.2 30.784 30.784 0 0 0-23.424 6.048 20.096 20.096 0 0 0-5.696 15.456 18.688 18.688 0 0 0 2.304 10.368c3.744 7.712 11.136 13.568 45.408 28.416 68.544 29.504 98.208 49.376 117.6 78.752a149.024 149.024 0 0 1 12.128 125.312 137.056 137.056 0 0 1-112.96 82.112 213.792 213.792 0 0 1-32.8 2.144z m-135.584-96.224a205.888 205.888 0 0 0 14.72 19.68 152.352 152.352 0 0 0 84.384 43.68 272.384 272.384 0 0 0 64.352 0.704 108 108 0 0 0 89.6-62.848 117.888 117.888 0 0 0-9.088-97.632c-15.648-23.68-41.92-40.736-104.192-67.552-35.648-15.424-51.968-24.8-60.8-42.976a48 48 0 0 1-5.472-23.776 49.856 49.856 0 0 1 15.36-37.824 60.256 60.256 0 0 1 46.4-14.272 66.56 66.56 0 0 1 53.024 30.24c14.784-9.6 30.464-19.936 40.352-26.752a215.68 215.68 0 0 0-12.8-15.168 99.2 99.2 0 0 0-49.728-28.544 220.032 220.032 0 0 0-62.848-1.856 96.544 96.544 0 0 0-81.696 75.008 174.048 174.048 0 0 0 1.408 51.2 106.048 106.048 0 0 0 21.568 39.36 212.992 212.992 0 0 0 80.928 49.344c44.576 19.2 60.128 28.8 69.312 41.824a55.04 55.04 0 0 1-7.264 70.752 99.712 99.712 0 0 1-106.432 6.72A138.4 138.4 0 0 1 745.6 870.4l-14.016 8.16z m-148.128 91.36H439.04v-338.24H320v-52.032c0-39.68 0.224-44.192 5.6-48.736a7.776 7.776 0 0 1 1.312-1.056c6.72-4.128 28.8-4.16 170.048-3.872l175.04 0.384 1.024 105.28h-119.232z m-84.224-30.56h53.664v-338.24h118.912l-0.416-44.256-144.768-0.416c-70.624 0-123.008 0-146.176 0.32 0 5.824-0.224 13.536-0.224 22.848v21.472h119.04z" fill="#007ACC" p-id="53681"></path></svg>',
        },
        title: "TypeScript Handbook（中文版）",
        desc: "TypeScript Handbook（中文版）",
        link: "https://zhongsp.gitbooks.io/typescript-handbook/content/",
      },
    ],
  },

  {
    title: "Node 相关",
    items: [
      {
        icon: {
          svg: '<svg t="1737686364416" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="38666" width="200" height="200"><path d="M0 0.036408m170.660599 0l682.642395 0q170.660599 0 170.660598 170.660598l0 682.642395q0 170.660599-170.660598 170.660599l-682.642395 0q-170.660599 0-170.660599-170.660599l0-682.642395q0-170.660599 170.660599-170.660598Z" fill="#C9EFEA" p-id="38667"></path><path d="M242.963806 494.525492a10.410297 10.410297 0 0 0-4.80694-8.70369l-82.912608-49.008035c-1.592832-1.109294-3.214108-1.109294-4.835384-1.109294h-1.023963a15.018133 15.018133 0 0 0-4.80694 1.109294l-82.941051 49.008035c-3.157221 1.621276-4.750053 5.432696-4.750054 8.70369v131.80687c0 1.621276 1.052407 3.242551 2.64524 4.351845 1.592832 1.109294 3.185665 1.109294 4.778496 0L113.773732 601.842566c3.214108-1.649719 4.80694-5.461139 4.806941-8.732134v-61.55159c0-3.782977 2.133257-7.082415 4.778496-8.70369l20.735263-12.515111a8.4477 8.4477 0 0 1 4.778497-1.649719c1.592832 0 3.697646 0.568869 4.80694 1.621276l20.706819 12.543554c3.214108 1.621276 4.778497 5.432696 4.778497 8.70369v61.011164c0 3.81142 2.133257 7.082415 4.80694 8.703691l49.434687 28.870085c1.592832 1.08085 3.72609 1.08085 4.778497 0 1.592832-1.08085 2.645239-2.73057 2.645239-4.380289l2.161701-131.238001z" fill="#333333" p-id="38668"></path><path d="M647.457868 563.159497c0 1.08085-0.540425 1.649719-1.08085 2.190144l-28.699424 16.866956c-0.511982 0.568869-1.564389 0.568869-2.673683 0L586.33293 565.349641c-0.540425-0.568869-1.08085-1.109294-1.08085-2.190144V529.368698c0-1.109294 0.568869-1.621276 1.08085-2.190144l28.670981-16.866956c0.568869-0.568869 1.621276-0.568869 2.673683 0l28.727867 16.866956c0.511982 0.568869 1.052407 1.08085 1.052407 2.190144v33.762355z m50.828415-221.11925L649.363578 313.710588a3.925194 3.925194 0 0 0-4.80694 0c-1.564389 1.109294-2.645239 2.73057-2.645239 4.380289v130.15715c0 1.08085-0.511982 2.73057-1.592833 3.270995a4.408732 4.408732 0 0 1-3.726089 0l-20.70682-12.003129a11.092939 11.092939 0 0 0-10.125862 0L522.818744 488.552371C519.661523 490.173647 518.068691 494.013511 518.068691 497.227619v98.044514c0 3.81142 2.104814 7.082415 4.750053 8.70369l82.941051 49.008035a11.092939 11.092939 0 0 0 10.125862 0l82.912608-49.008035c3.185665-1.621276 4.80694-5.432696 4.80694-8.70369V350.743938a9.727654 9.727654 0 0 0-5.318922-8.703691z" fill="#333333" p-id="38669"></path><path d="M933.854796 528.287848c3.185665-1.621276 4.778497-5.432696 4.778497-8.703691v-23.977814a10.410297 10.410297 0 0 0-4.778497-8.732134L851.454171 437.866174a11.121382 11.121382 0 0 0-10.125863 0L758.415701 486.874209C755.230036 488.523928 753.637204 492.335348 753.637204 495.606343V593.650857c0 3.81142 2.133257 7.053971 5.318922 8.70369l82.372182 47.927185a9.955202 9.955202 0 0 0 9.585437 0l49.975112-28.329659c1.592832-1.08085 2.673683-2.73057 2.673683-4.351845 0-1.649719-1.08085-3.81142-2.673683-4.351846L817.407381 564.240347c-1.564389-1.109294-2.645239-2.73057-2.645239-4.351845V529.368698c0-1.621276 1.08085-3.270995 2.645239-4.351845l26.082628-15.24568a3.81142 3.81142 0 0 1 4.750054 0l26.054184 15.24568c1.621276 1.08085 2.673683 2.73057 2.673683 4.351845v23.977814c0 1.621276 1.052407 3.270995 2.645239 4.351845 1.592832 1.08085 3.697646 1.08085 4.806941 0l49.434686-29.410509z" fill="#333333" p-id="38670"></path><path d="M375.709308 437.354192a11.036052 11.036052 0 0 1 10.097419 0l82.912607 49.008035c3.214108 1.621276 4.835384 5.432696 4.835384 8.703691v98.044514a10.324966 10.324966 0 0 1-4.835384 8.70369l-82.912607 49.008035a10.922278 10.922278 0 0 1-10.097419 0l-82.941051-49.008035c-3.185665-1.621276-4.778497-5.404252-4.778497-8.70369v-98.044514c0-3.81142 2.133257-7.082415 4.778497-8.703691l82.941051-49.008035z" fill="#6FB009" p-id="38671"></path><path d="M845.054398 523.964446c0.568869-0.568869 1.08085-0.568869 2.161701 0l15.928323 9.244115c0.568869 0.540425 1.052407 1.08085 1.052407 1.621276v19.0571c0 0.568869-0.511982 1.109294-1.052407 1.649719l-15.928323 9.244116c-0.568869 0.568869-1.08085 0.568869-2.133258 0l-15.956765-9.244116c-0.540425-0.568869-1.052407-1.109294-1.052408-1.649719v-19.0571c0-0.568869 0.511982-1.08085 1.052408-1.621276l15.928322-9.272559z" fill="#333333" p-id="38672"></path></svg>',
        },
        title: "Node.js",
        desc: "Node.js 是一个基于 Chrome V8 引擎的 JavaScript 运行环境",
        link: "https://nodejs.org/zh-cn",
      },
      {
        icon: {
          svg: '<svg t="1737686544679" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="49603" width="200" height="200"><path d="M512.017287 512.060244m-511.939756 0a511.939756 511.939756 0 1 0 1023.879512 0 511.939756 511.939756 0 1 0-1023.879512 0Z" fill="#F8E294" p-id="49604"></path><path d="M65.34985 592.325085a511.939756 511.939756 0 0 0 21.026097 144.988652A481.771877 481.771877 0 1 0 819.18114 141.086757 511.939756 511.939756 0 0 0 65.34985 592.325085z" fill="#F6D65D" p-id="49605"></path><path d="M427.181556 967.13812a602.07772 602.07772 0 0 1-171.134147-23.768632 489.268138 489.268138 0 0 0 748.529057-417.779407 603.357569 603.357569 0 0 1-577.39491 441.548039z" fill="#F2C13A" p-id="49606"></path><path d="M939.852654 230.85905A511.939756 511.939756 0 1 0 1023.957043 512.060244a511.939756 511.939756 0 0 0-84.104389-281.201194zM512.017287 993.832122A481.589042 481.589042 0 1 1 993.789164 512.060244 482.137548 482.137548 0 0 1 512.017287 993.832122z" fill="#D98613" p-id="49607"></path><path d="M769.998357 596.164633a264.563152 264.563152 0 0 1-525.286757-2.376863z" fill="#E86563" p-id="49608"></path><path d="M507.446396 850.306154a286.869099 286.869099 0 0 1-285.223578-254.141521L219.480284 570.933316l576.297896 2.742535-3.108205 25.231316a287.417606 287.417606 0 0 1-285.223579 251.398987zM271.222766 616.459387a242.07437 242.07437 0 0 0 471.715918 2.194028z" fill="#C44F1C" p-id="49609"></path><path d="M625.375376 405.649909l44.611893-44.611893a30.167878 30.167878 0 0 0 0-42.600701 30.167878 30.167878 0 0 0-42.600701 0L562.114249 384.075305a31.996235 31.996235 0 0 0 0 43.880551l65.089483 65.089483a30.167878 30.167878 0 1 0 42.600701-42.600701zM378.364444 405.649909l-44.611893 44.611893a30.167878 30.167878 0 0 0 0 42.600702 30.167878 30.167878 0 0 0 42.600701 0l65.089483-65.089484a31.996235 31.996235 0 0 0 0-43.88055l-65.089483-65.089483a30.167878 30.167878 0 0 0-42.600701 42.600701z" fill="#582A14" p-id="49610"></path></svg>',
        },
        title: "Express",
        desc: "基于 Node.js 平台，快速、开放、极简的 Web 开发框架",
        link: "https://expressjs.com",
      },
      {
        icon: {
          svg: '<svg t="1737686438687" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="40955" width="200" height="200"><path d="M0 238.378667v544.298666h50.773333v-174.890666l19.626667-22.485334 134.272 197.376h50.773333L99.413333 553.386667l118.314667-133.546667h-7.253333L50.773333 599.808v-361.386667z m470.997333 178.56c-50.773333 0-92.885333 16.682667-126.293333 50.048-32.853333 33.408-49.322667 80.341333-49.322667 140.8 0 60.501333 15.957333 105.258667 47.872 134.272 31.957333 29.013333 73.301333 43.52 124.117334 43.52 51.285333 0 93.354667-16.64 126.293333-50.048 33.365333-33.408 50.048-80.341333 50.048-140.8 0-60.458667-15.957333-105.216-47.872-134.272-31.957333-29.013333-73.557333-43.52-124.842667-43.52z m379.562667 0a311.04 311.04 0 0 0-131.370667 29.738666l2.901334 5.12c11.136-6.314667 28.586667-12.629333 52.266666-18.901333 24.192-6.784 45.226667-10.154667 63.146667-10.154667 17.92 0 32.426667 2.432 43.52 7.253334 11.093333 4.352 18.858667 9.685333 23.253333 15.957333 4.352 6.314667 7.68 12.8 10.154667 19.626667 2.901333 6.272 3.84 11.605333 2.901333 15.957333 0.298667 41.386667 0 84.821333 0 126.976a395.477333 395.477333 0 0 0-35.584-1.450667c-13.056 0-27.306667 0.725333-42.794666 2.176-62.421333 3.882667-102.826667 14.506667-121.216 31.957334-9.173333 8.704-14.762667 16.682667-16.682667 23.936-1.962667 7.253333-2.901333 14.037333-2.901333 20.309333 0 5.802667 0.469333 11.648 1.450666 17.450667 8.234667 55.125333 42.794667 82.730667 103.765334 82.730666 52.266667 0 90.24-21.546667 113.92-64.597333v15.232c0 7.722667 5.589333 16.938667 16.725333 27.562667 12.074667 12.586667 34.56 18.901333 67.498667 18.901333H1024v-5.802667h-22.485333l-7.978667-1.450666c-5.802667-0.512-11.605333-4.394667-17.450667-11.648-5.290667-7.722667-7.978667-18.602667-7.978666-32.64v-243.114667c0-15.488-6.272-30.250667-18.858667-44.288-21.248-23.765333-66.730667-26.624-98.688-26.88z m-378.112 5.802666c36.778667 0 66.261333 14.037333 88.533333 42.069334 22.272 28.074667 33.408 71.381333 33.408 129.92 0 58.026667-12.117333 103.552-36.266666 136.448-24.234667 32.426667-54.698667 48.64-91.477334 48.64-36.778667 0-66.304-14.08-88.533333-42.112-22.272-28.074667-33.408-71.125333-33.408-129.194667 0-58.538667 12.117333-104.021333 36.266667-136.448 24.234667-32.853333 54.698667-49.322667 91.477333-49.322667z m404.949333 190.122667c13.568 0 26.88 0.512 39.936 1.450667v87.808c-1.450667 16.469333-12.586667 33.664-33.408 51.541333a103.082667 103.082667 0 0 1-68.949333 26.154667c-38.698667 0-60.202667-25.642667-64.554667-76.928a134.613333 134.613333 0 0 1-0.853333-13.098667c0-21.290667 5.589333-37.973333 16.725333-50.048 11.093333-12.117333 35.072-20.352 71.850667-24.704 13.397333-1.621333 27.306667-1.664 39.253333-2.133333z" fill="#33333D" p-id="40956"></path></svg>',
        },
        title: "Koa",
        desc: "基于 Node.js 平台的下一代 web 开发框架",
        link: "https://koajs.com",
      },
      {
        icon: "https://www.eggjs.org/favicon.png",
        title: "Egg",
        desc: "为企业级框架和应用而生",
        link: "https://www.eggjs.org/zh-CN",
      },
      {
        icon: "https://d33wubrfki0l68.cloudfront.net/e937e774cbbe23635999615ad5d7732decad182a/26072/logo-small.ede75a6b.svg",
        title: "Nest.js 中文文档",
        desc: "用于构建高效且可伸缩的服务端应用程序的渐进式 Node.js 框架",
        link: "https://docs.nestjs.cn",
      },
      {
        icon: "https://fastify.com.cn/img/logos/fastify-black.svg",
        title: "Fastify",
        desc: "快速且开销低的 Web 框架，适用于 Node.js",
        link: "https://fastify.com.cn/",
      },
      {
        icon: {
          svg: '<svg t="1737686892793" class="icon" viewBox="0 0 1683 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="50643" width="200" height="200"><path d="M398.1312 267.320889h316.928v25.247289H427.190044v189.997511h270.700089v25.247289H427.190044v208.600178h291.168712v25.247288H398.1312v-474.339555z m345.315556 0h33.678222l149.219555 208.600178 152.519111-208.600178L1286.314667 2.3552 945.493333 497.846044l175.627378 243.8144H1086.122667L926.344533 519.771022 765.906489 741.660444h-34.338133L908.515556 497.846044 743.458133 267.320889z m390.223644 25.247289v-25.247289h361.153422v25.247289h-166.377244v449.080889h-29.058845v-449.080889H1133.681778zM1.649778 267.320889h36.317866l500.747378 750.967467L331.776 741.660444 32.017067 303.195022l-1.319823 438.465422H1.649778v-474.339555z m1490.261333 441.469155c-5.950578 0-10.399289-4.608-10.399289-10.558577 0-5.961956 4.448711-10.569956 10.387911-10.569956 6.007467 0 10.387911 4.608 10.387911 10.569956 0 5.950578-4.380444 10.558578-10.387911 10.558577z m28.535467-27.795911H1536c0.216178 8.442311 6.371556 14.108444 15.405511 14.108445 10.103467 0 15.826489-6.087111 15.826489-17.5104v-72.317156h15.826489v72.385422c0 20.571022-11.867022 32.415289-31.516445 32.415289-18.432 0-31.084089-11.491556-31.084088-29.0816z m83.308089-0.910222h15.689955c1.342578 9.705244 10.808889 15.872 24.450845 15.872 12.708978 0 22.038756-6.599111 22.038755-15.6672 0-7.793778-5.927822-12.481422-19.433244-15.6672l-13.141334-3.185778c-18.432-4.323556-26.851556-13.266489-26.851555-28.296533 0-18.2272 14.836622-30.355911 37.091555-30.355911 20.707556 0 35.84 12.128711 36.750223 29.354667h-15.405511c-1.479111-9.4208-9.671111-15.314489-21.549512-15.314489-12.515556 0-20.844089 6.030222-20.844088 15.246222 0 7.304533 5.370311 11.491556 18.659555 14.609067l11.229867 2.7648c20.912356 4.892444 29.536711 13.403022 29.536711 28.785777 0 19.569778-15.132444 31.8464-39.287467 31.8464-22.607644 0-37.808356-11.707733-38.934755-30.0032z" p-id="50644"></path></svg>',
        },
        title: "Next.js",
        desc: "Next.js 15 中文文档，完整同步官方最新文档",
        link: "https://nextjscn.org/",
      },
    ],
  },
  {
    title: "可视化",
    items: [
      {
        icon: "https://echarts.apache.org/zh/images/favicon.png",
        title: "ECharts",
        desc: "一个基于 JavaScript 的开源可视化图表库",
        link: "https://echarts.apache.org/zh/index.html",
      },
      {
        icon: "https://www.isqqw.com/assets/layout/images/logo.png",
        title: "ECharts Demo集",
        desc: "ECharts Demo集",
        link: "https://www.isqqw.com/",
      },
      {
        icon: "https://mdn.alipayobjects.com/huamei_qa8qxu/afts/img/A*A-lcQbVTpjwAAAAAAAAAAAAADmJ7AQ/original",
        title: "AntV",
        desc: "蚂蚁集团全新一代数据可视化解决方案，致力于提供一套简单方便、专业可靠、无限可能的数据可视化最佳实践。",
        link: "https://antv.vision/zh/",
      },
      {
        icon: "https://d3js.org/logo.svg",
        title: "D3.js",
        desc: "一个遵循 Web 标准用于可视化数据的 JavaScript 库",
        link: "https://d3js.org",
      },
      {
        icon: "https://www.chartjs.org/favicon.ico",
        title: "Chart.js",
        desc: "一个简单而灵活的 JavaScript 图表库",
        link: "https://www.chartjs.org",
      },
      {
        icon: "https://threejs.org/files/favicon.ico",
        // icon: 'https://threejs.org/files/favicon_white.ico',
        title: "Three.js",
        desc: "JavaScript 3d 库",
        link: "https://threejs.org",
      },
    ],
  },

  {
    title: "摸鱼专用",
    items: [
      {
        icon: "https://icons.mydrivers.com/icon/dkkj_logo2022@2x.gif",
        title: "快科技",
        desc: "快科技--科技改变未来",
        link: "https://www.mydrivers.com/",
      },
      {
        icon: {
          svg: '<svg t="1737687821897" class="icon" viewBox="0 0 2035 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="51763" width="200" height="200"><path d="M0 0m60.959571 0l1332.402044 0q60.959571 0 60.959571 60.959571l0 605.241451q0 60.959571-60.959571 60.959571l-1332.402044 0q-60.959571 0-60.959571-60.959571l0-605.241451q0-60.959571 60.959571-60.959571Z" fill="#FFFFFF" p-id="51764"></path><path d="M1393.361615 0a60.959571 60.959571 0 0 1 60.959571 60.959571v605.241451a60.959571 60.959571 0 0 1-60.959571 60.959571H60.959571a60.959571 60.959571 0 0 1-60.959571-60.959571V60.959571a60.959571 60.959571 0 0 1 60.959571-60.959571h1332.402044z m0 8.70851H60.959571a52.251061 52.251061 0 0 0-52.216227 50.291646L8.70851 60.959571v605.241451a52.251061 52.251061 0 0 0 50.291646 52.216227L60.959571 718.452083h1332.402044a52.251061 52.251061 0 0 0 52.216227-50.291646L1445.612676 666.201022V60.959571a52.251061 52.251061 0 0 0-50.291646-52.216227L1393.361615 8.70851z" fill="#EEEEEE" p-id="51765"></path><path d="M0 215.535625l1454.321186-52.251061v348.340404l-1454.321186 52.251061z" fill="#FF4242" p-id="51766"></path><path d="M334.267451 368.422228l41.435091-50.613861 35.748434-1.872329 32.97042 46.712448 45.893848-2.403549-48.663155-68.91044-103.143593 5.407984 5.651823 6.244002-55.795424 67.839294 45.902556-2.403549z m84.786055 0.165462l-11.103351-31.638017-41.304463 2.168419 11.10335 31.629308 41.304464-2.15971z m-11.286229 98.928674l63.458913-69.450368 2.299046-25.550768-163.058143 8.543048-2.299046 25.550769 110.162652-5.765034-63.223783 69.44166 52.660361-2.760598z m284.59411-19.028094l14.543211-166.445754-183.601518 9.622904 8.447255 8.760761-13.79428 157.206024 174.41404-9.143935z m-37.41176-94.68763l-82.617635 4.328129 4.110417-46.242188 82.617635-4.32813-4.110417 46.242189z m-6.540091 73.978793l-82.617635 4.328129 4.354255-50.857699 82.617635-4.319421-4.354255 50.857699z m207.515087-38.491615l8.508214-27.083466 20.726254 7.140978 2.420966-27.736605-15.048305-5.268648 9.744823-31.27226 13.045348-0.687972-7.271606 83.227231 50.491941-2.647387 3.396319-36.993751-10.154122 9.736114-4.589385 0.243838 7.019059-78.61172-44.448236 2.325172 4.354255-14.02941-45.893848 2.403549 6.670719 7.158395-2.090043 6.409464-19.568022 1.018895-2.177127 23.129803 14.490961-0.75764-5.582155 18.218203-10.119289-3.587906-2.420966 27.736604 4.44134 1.46303-12.670882 40.39007 36.723787-1.915872z m-71.505576 3.74466c4.511008-0.226421 8.490797-2.011666 11.948076-5.347026 3.465987-3.326651 5.468944-7.349983 6.034997-12.061286l2.142294-23.852609 18.662337-4.371672 2.055208-25.54206-18.435916 4.119125 1.158232-14.839301 18.357539-0.957936 1.941998-23.112386-18.113701 0.949227 1.332402-16.058492-36.723787 1.915872-1.57624 16.07591-22.946924 1.201774-1.941998 23.112386 22.946924-1.201775-2.020374 21.422935-23.216888 5.338317-2.055209 25.54206 22.990467-5.08577-0.87956 10.946597-20.308245 23.835192 38.648368-2.020374z m52.860656 51.981096l-4.789681-45.284252-41.313171 2.15971 4.798389 45.284253 41.313171-2.159711z m50.248103-2.62997l-4.78968-45.284252-41.313172 2.15971 4.798389 45.284253 41.304463-2.159711z m-114.499491 6.000164l13.324021-46.242189-41.313172 2.168419-13.32402 46.242189 41.313171-2.177128z m164.991433-8.647551l-4.789681-45.284252-41.313172 2.15971 4.789681 45.284253 41.313172-2.159711z m65.470579-3.431153l10.781135-122.406818 19.080346-1.001478 2.177127-23.129803-19.080345 1.001479 2.560302-29.69602-36.471241 1.915872 5.198981 6.757804-1.968123 22.633418-19.332893 1.010187-2.177127 23.121094 19.332892-1.010187-10.781135 122.406818 30.680081-1.602366z m154.401884-150.526597l1.672034-18.984552-38.40453 2.011666 1.254025-12.906012-44.448235 2.333881 8.212125 8.778178-0.296089 3.648866-36.471241 1.915872-1.672034 18.975843 110.162653-5.773742z m-91.561276 55.420958l0.870851-11.181726 64.00755-3.361485-0.870851 11.190435 30.201113-1.584949 2.682221-32.108276-22.224118 1.158231 6.278836-14.133912-29.957275 1.567532-6.522674 14.151329-16.18912 0.844726-3.85787-13.602693-30.192405 1.584949 3.85787 13.602693-25.124051 1.314985-2.673513 32.116985 29.713436-1.558824zM967.036503 429.503718l13.019223-107.506557-14.255831 0.740223-13.254352 107.523974 14.49096-0.75764z m59.670712-16.938052l4.319421-93.242018-14.255831 0.748932-4.554551 93.250726 14.490961-0.75764z m39.345048 20.464998l15.501148-41.748597 37.194047-1.950706-1.93329 23.112386-13.916199 16.476501 33.823854-1.767828c3.056687-0.165462 5.817285-1.358528 8.290501-3.587906 2.464508-2.229379 3.770785-4.963851 3.927538-8.194708l4.119125-46.242189-64.503934 3.378902 1.915872-4.946433 66.924901-3.50953 1.950706-22.868548-43.002623 2.255505 1.262734-12.906012-38.1694 2.002957-1.262734 12.897303-42.993914 2.264213-1.950706 22.868548 23.66973-1.245317-24.427371 65.470578 33.580015-1.759119z" fill="#FFFFFF" p-id="51767"></path></svg>',
        },
        title: "今日热榜",
        desc: "今日热榜,今日热榜官网,即时热榜,每日热榜,每日热搜,热搜,热榜,今日热搜,热点事件",
        link: "https://rebang.today/",
      },
      {
        icon: "https://www.expreview.com/exp_new/static/exp5/images/exp-logo2.svg",
        title: "超能网",
        desc: "超能网（Expreview）专注于优质创造，致力于价值传播，提供100%原创科技资讯。",
        link: "https://www.expreview.com/",
      },
      {
        icon: "https://momoyu.cc/icon-192.png",
        title: "摸摸鱼热榜",
        // desc: '聚合每日热门、搞笑、有趣、适合摸鱼的资讯',
        link: "https://momoyu.cc",
      },
      {
        icon: "https://v.qq.com/favicon.ico",
        title: "腾讯视频",
        // desc: '中国领先的在线视频媒体平台，海量高清视频在线观看',
        link: "https://v.qq.com",
      },
      {
        icon: "https://static.hdslb.com/mobile/img/512.png",
        title: "哔哩哔哩",
        // desc: '',
        link: "https://www.bilibili.com",
      },
      {
        icon: "https://www.youtube.com/s/desktop/014dbbed/img/favicon_48x48.png",
        title: "YouTube",
        // desc: '',
        link: "https://www.youtube.com",
      },
      {
        icon: "/icons/pixiv.png",
        title: "Pixiv",
        // desc: '',
        link: "https://www.pixiv.net",
      },
    ],
  },
];
